<a href="https://colab.research.google.com/github/RudinP/SOLUX_Summer_data_study/blob/master/2%EC%A3%BC%EC%B0%A8/%EC%B1%95%ED%84%B013(0802).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
job_list=[{'name':'John','job':'teacher'},
         {'name':'Nate','job':'teacher'},
         {'name':'Fred','job':'teacher'},
         {'name':'Abra','job':'student'},
         {'name':'Bria','job':'student'},
         {'name':'Jann','job':'developer'},
         {'name':'Nate','job':'teacher'},
         {'name':'Ian','job':'teacher'},
         {'name':'Chri','job':'banker'},
         {'name':'Phil','job':'lawyer'},
         {'name':'Jann','job':'basketball player'},
         {'name':'Gwen','job':'teacher'},
         {'name':'Jess','job':'student'},
]#치느라 힘들었다
df=pd.DataFrame(job_list, columns=['name','job'])
df

    name                job
0   John            teacher
1   Nate            teacher
2   Fred            teacher
3   Abra            student
4   Bria            student
5   Jann          developer
6   Nate            teacher
7    Ian            teacher
8   Chri             banker
9   Phil             lawyer
10  Jann  basketball player
11  Gwen            teacher
12  Jess            student

In [ ]:
df.job.unique()#job column에 있는 값들을 중복없이 나열.class에 있는 값들을 하나씩.

array(['teacher', 'student', 'developer', 'banker', 'lawyer',
       'basketball player'], dtype=object)

In [ ]:
#각 직업별로 몇개씩 있는지 알려면
df.job.value_counts()

teacher              6
student              3
banker               1
basketball player    1
developer            1
lawyer               1
Name: job, dtype: int64